tutorials/reactiveTransport/reactiveTransportALEFoam/3DcalcitePostALE/system/controlDictRun
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dissolTransportDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         var;

deltaT          initTimestep;

writeControl    adjustableRunTime;

writeInterval   WriteTimestep;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

checkFrequency 1;
remeshFrequency 200;

libs (
"libfvMotionSolverGCFOAM.so"
"libmeshToolsGCFOAM.so"
);

adjustTimeStep true;
maxMeshCo 0.01;

maxDeltaT maxTimestep;

OptimisationSwitches
{
    commsType       blocking;
}

// ************************************************************************* //
